app/Controllers/Book.php

    public function store()
    {
        $bookappointments = new bookm();

        $court = $this->request->getPost('court');
        $date = $this->request->getPost('date');
        $slot = $this->request->getPost('slot');

        $data = ['court'=>$court,'date'=>$date,'slot'=>$slot];

        $bookappointments->save($data);
---
INSERT INTO `book` (`court`, `date`, `slot`) VALUES ('badminton1 ', '2023-03-31', '04:00-05:00 PM')