app/Controllers/Contacts.php


        $data = ['name'=>$name,'email'=>$email,'message'=>$message];

        $r = $ContactModel->insert( $data );
---
INSERT INTO `contact` (`name`, `email`, `message`) VALUES ('shaalini rajan', 'shweetharthy00@gmail.com', 'kjwfjlkesd;ghjk wriertwjnfnjkkjkjdksjnm,,scekkkkekekkwritwe your storyb mkfmkwk popular  review veego homekrk login  vbbook ')