app/Controllers/Dashboards.php

    public function update($id){
        $bookm = new bookm();
        $bookm->find($id);

        $data=['court' => $this->request->getPost('court'),
        'date' => $this->request->getPost('date'),
        'slot' => $this->request->getPost('slot')
        ];
        $bookm->update($id,$data);
---
UPDATE `book` SET `deleted_at` = '2023-03-22 06:07:52'
WHERE `id` IN ('16')
AND `deleted_at` IS NULL