app/Controllers/Login.php

    public function do_login()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'john@gmail.com'
 LIMIT 1