app/Controllers/Register.php

INSERT INTO `users` (`name`, `email`, `password`, `gender`) VALUES ('anu', 'anu@gmail.com', '$2y$10$Pap/Ks53mCVudEObAbS7q.32SSxbx3zjj1sEelOzPp7pU.NWLStje', 'Female')
---

    else
    {
        $r =$userModel->insert( $data );